import AgeClusterModel from "./age_cluster_model"

//fake data
const femaleClothe = [
	{
	  name: '上衣',
      "20歲以下": 1500,
	  "20~30歲": 4000,
	  "31~45歲": 2400,
	  "46~60歲": 2400,
      "60歲以上": 1500,
	},
	{
	  name: '褲子',
      "20歲以下": 1500,
	  "20~30歲": 3000,
	  "31~45歲": 1398,
	  "46~60歲": 2210,
      "60歲以上": 1500,
	},
	{
	  name: '裙子',
      "20歲以下": 1500,
	  "20~30歲": 2000,
	  "31~45歲": 9800,
	  "46~60歲": 2290,
      "60歲以上": 1500,
	},
	{
	  name: '外套',
      "20歲以下": 1500,
	  "20~30歲": 2780,
	  "31~45歲": 3908,
	  "46~60歲": 2000,
      "60歲以上": 1500,
	},
	{
	  name: '運動裝',
      "20歲以下": 1500,
	  "20~30歲": 1890,
	  "31~45歲": 4800,
	  "46~60歲": 2181,
      "60歲以上": 1500,
	},
	{
	  name: '毛衣',
      "20歲以下": 1500,
	  "20~30歲": 2390,
	  "31~45歲": 3800,
	  "46~60歲": 2500,
      "60歲以上": 1500,
	},
]

const maleClothe = [
	{
	  name: '襯衫',
      "20歲以下": 1500,
	  "20~30歲": 4000,
	  "31~45歲": 2400,
	  "46~60歲": 2400,
      "60歲以上": 1500,
	},
	{
	  name: '長褲',
      "20歲以下": 1500,
	  "20~30歲": 3000,
	  "31~45歲": 1398,
	  "46~60歲": 2210,
      "60歲以上": 1500,
	},
	{
	  name: '短褲',
      "20歲以下": 1500,
	  "20~30歲": 2000,
	  "31~45歲": 9800,
	  "46~60歲": 2290,
      "60歲以上": 1500,
	},
	{
	  name: '外套',
      "20歲以下": 1500,
	  "20~30歲": 2780,
	  "31~45歲": 3908,
	  "46~60歲": 2000,
      "60歲以上": 1500,
	},
	{
	  name: '運動裝',
      "20歲以下": 1500,
	  "20~30歲": 1890,
	  "31~45歲": 4800,
	  "46~60歲": 2181,
      "60歲以上": 1500,
	},
	{
	  name: '毛衣',
      "20歲以下": 1500,
	  "20~30歲": 2390,
	  "31~45歲": 3800,
	  "46~60歲": 2500,
      "60歲以上": 1500,
	},
]

const shoes = [
	{
	  name: '運動鞋',
      "20歲以下": 1500,
	  "20~30歲": 4000,
	  "31~45歲": 2400,
	  "46~60歲": 2400,
      "60歲以上": 1500,
	},
	{
	  name: '休閒鞋',
      "20歲以下": 1500,
	  "20~30歲": 3000,
	  "31~45歲": 1398,
	  "46~60歲": 2210,
      "60歲以上": 1500,
	},
	{
	  name: '高跟鞋',
      "20歲以下": 1500,
	  "20~30歲": 2000,
	  "31~45歲": 9800,
	  "46~60歲": 2290,
      "60歲以上": 1500,
	},
	{
	  name: '涼鞋',
      "20歲以下": 1500,
	  "20~30歲": 2780,
	  "31~45歲": 3908,
	  "46~60歲": 2000,
      "60歲以上": 1500,
	},
	{
	  name: '靴子',
      "20歲以下": 1500,
	  "20~30歲": 1890,
	  "31~45歲": 4800,
	  "46~60歲": 2181,
      "60歲以上": 1500,
	},
]

const accessories = [
	{
	  name: '手袋',
      "20歲以下": 1500,
	  "20~30歲": 4000,
	  "31~45歲": 2400,
	  "46~60歲": 2400,
      "60歲以上": 1500,
	},
	{
	  name: '飾品',
      "20歲以下": 1500,
	  "20~30歲": 3000,
	  "31~45歲": 1398,
	  "46~60歲": 2210,
      "60歲以上": 1500,
	},
	{
	  name: '帽子',
      "20歲以下": 1500,
	  "20~30歲": 2000,
	  "31~45歲": 9800,
	  "46~60歲": 2290,
      "60歲以上": 1500,
	},
	{
	  name: '眼鏡',
      "20歲以下": 1500,
	  "20~30歲": 2780,
	  "31~45歲": 3908,
	  "46~60歲": 2000,
      "60歲以上": 1500,
	},
	{
	  name: '襪子',
      "20歲以下": 1500,
	  "20~30歲": 1890,
	  "31~45歲": 4800,
	  "46~60歲": 2181,
      "60歲以上": 1500,
	},
]

const makeup = [
	{
	  name: '化妝品',
      "20歲以下": 1500,
	  "20~30歲": 4000,
	  "31~45歲": 2400,
	  "46~60歲": 2400,
      "60歲以上": 1500,
	},
	{
	  name: '臉部保養',
      "20歲以下": 1500,
	  "20~30歲": 3000,
	  "31~45歲": 1398,
	  "46~60歲": 2210,
      "60歲以上": 1500,
	},
	{
	  name: '身體保養',
      "20歲以下": 1500,
	  "20~30歲": 2000,
	  "31~45歲": 9800,
	  "46~60歲": 2290,
      "60歲以上": 1500,
	},
]

const other = [
	{
	  name: '睡衣',
      "20歲以下": 1500,
	  "20~30歲": 4000,
	  "31~45歲": 2400,
	  "46~60歲": 2400,
      "60歲以上": 1500,
	},
	{
	  name: '家居服',
      "20歲以下": 1500,
	  "20~30歲": 3000,
	  "31~45歲": 1398,
	  "46~60歲": 2210,
      "60歲以上": 1500,
	},
	{
	  name: '泳衣',
      "20歲以下": 1500,
	  "20~30歲": 2000,
	  "31~45歲": 9800,
	  "46~60歲": 2290,
      "60歲以上": 1500,
	},
]

export const AgeClusterResult = () => {
    return (
    <>
        <div className="w-full flex justify-between place-items-center">
			<AgeClusterModel data={femaleClothe} title={"女裝分析"} />
			<AgeClusterModel data={maleClothe} title={"男裝"} />
            <AgeClusterModel data={shoes} title={"鞋子"} />
		</div>
        <div className="w-full flex justify-between place-items-center">
            <AgeClusterModel data={accessories} title={"配飾"} />
            <AgeClusterModel data={makeup} title={"美妝"} />
            <AgeClusterModel data={other} title={"其他"} />
        </div>
    </>
    )
}