import LocationClusterModel from "./location_cluster_model"

//fake data
const femaleClothe = [
	{
	  name: '上衣',
      "北部": 1500,
	  "中部": 4000,
	  "南部": 2400,
	  "東部": 2400,
	},
	{
	  name: '褲子',
      "北部": 1500,
	  "中部": 3000,
	  "南部": 1398,
	  "東部": 2210,
	},
	{
	  name: '裙子',
      "北部": 1500,
	  "中部": 2000,
	  "南部": 9800,
	  "東部": 2290,
	},
	{
	  name: '外套',
      "北部": 1500,
	  "中部": 2780,
	  "南部": 3908,
	  "東部": 2000,
	},
	{
	  name: '運動裝',
      "北部": 1500,
	  "中部": 1890,
	  "南部": 4800,
	  "東部": 2181,
	},
	{
	  name: '毛衣',
      "北部": 1500,
	  "中部": 2390,
	  "南部": 3800,
	  "東部": 2500,
	},
]

const maleClothe = [
	{
	  name: '襯衫',
      "北部": 1500,
	  "中部": 4000,
	  "南部": 2400,
	  "東部": 2400,
	},
	{
	  name: '長褲',
      "北部": 1500,
	  "中部": 3000,
	  "南部": 1398,
	  "東部": 2210,
	},
	{
	  name: '短褲',
      "北部": 1500,
	  "中部": 2000,
	  "南部": 9800,
	  "東部": 2290,
	},
	{
	  name: '外套',
      "北部": 1500,
	  "中部": 2780,
	  "南部": 3908,
	  "東部": 2000,
	},
	{
	  name: '運動裝',
      "北部": 1500,
	  "中部": 1890,
	  "南部": 4800,
	  "東部": 2181,
	},
	{
	  name: '毛衣',
      "北部": 1500,
	  "中部": 2390,
	  "南部": 3800,
	  "東部": 2500,
	},
]

const shoes = [
	{
	  name: '運動鞋',
      "北部": 1500,
	  "中部": 4000,
	  "南部": 2400,
	  "東部": 2400,
	},
	{
	  name: '休閒鞋',
      "北部": 1500,
	  "中部": 3000,
	  "南部": 1398,
	  "東部": 2210,
	},
	{
	  name: '高跟鞋',
      "北部": 1500,
	  "中部": 2000,
	  "南部": 9800,
      "東部": 2290,
	},
	{
	  name: '涼鞋',
      "北部": 1500,
	  "中部": 2780,
	  "南部": 3908,
	  "東部": 2000,
	},
	{
	  name: '靴子',
      "北部": 1500,
	  "中部": 1890,
	  "南部": 4800,
	  "東部": 2181,
	},
]

const accessories = [
	{
	  name: '手袋',
      "北部": 1500,
	  "中部": 4000,
	  "南部": 2400,
	  "東部": 2400,
	},
	{
	  name: '飾品',
      "北部": 1500,
	  "中部": 3000,
	  "南部": 1398,
	  "東部": 2210,
	},
	{
	  name: '帽子',
      "北部": 1500,
	  "中部": 2000,
	  "南部": 9800,
      "東部": 2290,
	},
	{
	  name: '眼鏡',
      "北部": 1500,
	  "中部": 2780,
	  "南部": 3908,
	  "東部": 2000,
	},
	{
	  name: '襪子',
      "北部": 1500,
	  "中部": 1890,
	  "南部": 4800,
	  "東部": 2181,
	},
]

const makeup = [
	{
	  name: '化妝品',
      "北部": 1500,
	  "中部": 4000,
	  "南部": 2400,
	  "東部": 2400,
	},
	{
	  name: '臉部保養',
      "北部": 1500,
	  "中部": 3000,
	  "南部": 1398,
	  "東部": 2210,
	},
	{
	  name: '身體保養',
      "北部": 1500,
	  "中部": 2000,
	  "南部": 9800,
      "東部": 2210,
	},
]

const other = [
	{
	  name: '睡衣',
      "北部": 1500,
	  "中部": 4000,
	  "南部": 2400,
	  "東部": 2400,
	},
	{
	  name: '家居服',
      "北部": 1500,
	  "中部": 3000,
	  "南部": 1398,
	  "東部": 2210,
	},
	{
	  name: '泳衣',
      "北部": 1500,
	  "中部": 2390,
	  "南部": 3800,
	  "東部": 2500,
	},
]

export const LocationClusterResult = () => {
    return (
    <>
        <div className="w-full flex justify-between place-items-center">
			<LocationClusterModel data={femaleClothe} title={"女裝分析"} />
			<LocationClusterModel data={maleClothe} title={"男裝"} />
            <LocationClusterModel data={shoes} title={"鞋子"} />
		</div>
        <div className="w-full flex justify-between place-items-center">
            <LocationClusterModel data={accessories} title={"配飾"} />
            <LocationClusterModel data={makeup} title={"美妝"} />
            <LocationClusterModel data={other} title={"其他"} />
        </div>
    </>
    )
}